%全亚声速等熵喷管流动 非守恒型麦考马克方法数值求解
clear; %清理内存变量
clc; %清理工作窗中的所有显示内容
r=1.4; %比热比
L=3; %喷管长度
i=31; %网格数目
C=0.5; %科朗数
x=linspace(0,L,i); %网格点横坐标
N=5001; %时间步
dx=L/(i-1); %空间步长
dt(1:N)=0; %时间步长
Pe=0.93; %喷管两端压力比
A(1:31)=0; %预分配内存
for j=1:31
if(x(j)<1.5)
    A(j)=1+2.2*(x(j)-1.5).*(x(j)-1.5); %喷管面积
else
    A(j)=1+0.2223*(x(j)-1.5).*(x(j)-1.5);%喷管面积
end
end
rho(N,i)=0; %流场密度赋值
T(N,i)=0; %流场温度赋值
V(N,i)=0; %流场速度赋值
%预分配内存
rhotav2(1:1400,1:30)=0;  Vtav2(1:1400,1:30)=0;
%初始条件
rho(1,:)=1-0.023*x; %流场密度初值
T(1,:)=1-0.009333*x; %流场温度初值
V(1,:)=0.05+0.11*x; %流场速度初值
%按时间步长推进
for k=1:N-1
    %计算预估步偏导数
    rhot(1:i-1)=-V(k,1:i-1).*(rho(k,2:i)-rho(k,1:i-1))/dx-rho(k,1:i-1)...
    .*(V(k,2:i)-V(k,1:i-1))/dx-rho(k,1:i-1).*V(k,1:i-1)...
    .*(log(A(2:i))-log(A(1:i-1)))/dx;
    Vt(1:i-1)=-V(k,1:i-1).*(V(k,2:i)-V(k,1:i-1))/dx-1/r.*((T(k,2:i)...
    -T(k,1:i-1))/dx+T(k,1:i-1)./rho(k,1:i-1).*(rho(k,2:i)-rho(k,1:i-1))/dx);
    Tt(1:i-1)=-V(k,1:i-1).*(T(k,2:i)-T(k,1:i-1))/dx-(r-1).*T(k,1:i-1)...
    .*((V(k,2:i)-V(k,1:i-1))/dx+V(k,1:i-1).*(log(A(2:i))-log(A(1:i-1)))/dx);
    %确定最小时间步长
    t=C*dx./(V(k,2:i-1)+sqrt(T(k,2:i-1)));
    dt(k)=min(t);
    %计算预估值
    rho_(1:i-1)=rho(k,1:i-1)+rhot(1:i-1).*dt(k);
    V_(1:i-1)=V(k,1:i-1)+Vt(1:i-1).*dt(k);
    T_(1:i-1)=T(k,1:i-1)+Tt(1:i-1).*dt(k);
    %校正偏导数
    rhot_(2:i-1)=-V_(2:i-1).*(rho_(2:i-1)-rho_(1:i-2))/dx-rho_(2:i-1)...
    .*(V_(2:i-1)-V_(1:i-2))/dx-rho_(2:i-1).*V_(2:i-1).*(log(A(2:i-1))-log(A(1:i-2)))/dx;
    Vt_(2:i-1)=-V_(2:i-1).*(V_(2:i-1)-V_(1:i-2))/dx-1/r.*((T_(2:i-1)...
    -T_(1:i-2))/dx+T_(2:i-1)./rho_(2:i-1).*(rho_(2:i-1)-rho_(1:i-2))/dx);
    Tt_(2:i-1)=-V_(2:i-1).*(T_(2:i-1)-T_(1:i-2))/dx-(r-1).*T_(2:i-1)...
    .*((V_(2:i-1)-V_(1:i-2))/dx+V_(2:i-1).*(log(A(2:i-1))-log(A(1:i-2)))/dx);
    %时间导数平均值
    rhotav(2:i-1)=0.5*(rhot(2:i-1)+rhot_(2:i-1)); rhotav2(k,2:i-1)=abs(rhotav(2:i-1));
    Vtav(2:i-1)=0.5*(Vt(2:i-1)+Vt_(2:i-1));Vtav2(k,2:i-1)=abs(Vtav(2:i-1));
    Ttav(2:i-1)=0.5*(Tt(2:i-1)+Tt_(2:i-1));
    %流场变量校正值
    rho(k+1,2:i-1)=rho(k,2:i-1)+rhotav(2:i-1)*dt(k);
    V(k+1,2:i-1)=V(k,2:i-1)+Vtav(2:i-1)*dt(k);
    T(k+1,2:i-1)=T(k,2:i-1)+Ttav(2:i-1)*dt(k);
    %入流边界值
    V(k+1,1)=2*V(k+1,2)-V(k+1,3);
    rho(k+1,1)=1;
    T(k+1,1)=1;
    %出流边界值
    rho(k+1,i)=2*rho(k+1,i-1)-rho(k+1,i-2);
    V(k+1,i)=2*V(k+1,i-1)-V(k+1,i-2);
    T(k+1,i)= Pe./rho(k+1,i);
    %马赫数
    Ma=V(1:k+1,1:i)./(sqrt(T(1:k+1,1:i)));
    %流场压强
    P=rho(1:k+1,1:i).*T(1:k+1,1:i);
end